{
  "interstellar": {
    "title": "Интерстеллар",
    "year": 2014,
    "country": "США",
    "budget": "$165 млн",
    "genre": "Фантастика, Драма",
    "boxOffice": "$677 млн",
    "director": "Кристофер Нолан",
    "poster": "img.png",
    "runtime": "169 мин",
    "trailer": "https://www.youtube.com/embed/zSWdZVtXT7E?si=PJqcra0Bc6TDjAvO",
    "cast": [
      {"name": "Мэттью МакКонахи", "photo": "actor1.jpg"},
      {"name": "Анн Хэтэуэй", "photo": "actor2.jpg"},
      {"name": "Джессика Честейн", "photo": "actor3.jpg"},
      {"name": "Майкл Кейн", "photo": "actor4.jpg"}
    ],
    "synopsis": "Фильм \"Интерстеллар\" разворачивается в будущем, когда Земля страдает от экологической катастрофы, угрожающей выживанию человечества. Главный герой, Купер (Мэттью МакКонахи), бывший пилот НАСА, теперь фермер, живущий со своими детьми, Томом и Мёрф. Мёрф обнаруживает странные гравитационные аномалии в своем доме, которые указывают на координаты секретной базы НАСА.\n\nКупер и Мёрф находят эту базу, где профессор Бранд (Майкл Кейн) раскрывает план по спасению человечества: исследовать потенциально пригодные для жизни планеты, находящиеся за червоточиной, недавно обнаруженной возле Сатурна. Куперу предлагают возглавить экспедицию, чтобы найти новый дом для человечества. Несмотря на протесты Мёрф, он соглашается.\n\nКоманда космического корабля \"Эндьюранс\" путешествует через червоточину к другой галактике. Они исследуют три планеты, но сталкиваются с различными трудностями. На первой планете сильные гравитационные эффекты приводят к серьезным потерям. На второй они обнаруживают доктора Мэнна (Мэтт Дэймон), который обманом заманил их, чтобы спастись самому. В попытке сбежать он саботирует их миссию, что приводит к еще большим проблемам.\n\nКупер решает пожертвовать собой, отправившись в черную дыру Гаргантюа. Там он попадает в пятимерное пространство, где находит способ передать научные данные своей дочери Мёрф в прошлое. Благодаря этим данным взрослая Мёрф решает уравнения гравитации, позволяющие человечеству покинуть Землю и начать новую жизнь в космосе.\n\nВ финале Купер возвращается и встречается с пожилой Мёрф. Затем он отправляется в новое путешествие, чтобы найти доктора Амелию Бранд (Энн Хэтэуэй) на третьей планете, где человечество может начать все сначала.",
    "videoPlayer": "https://69695.svetacdn.in/nPBZWDQ5doe2/movie/16?domain=kinogo.ec",
    "recommended": [
      {"title": "Similar Film 1", "photo": "recommended1.jpg"},
      {"title": "Similar Film 2", "photo": "recommended2.jpg"}
    ]
  },
  "deadpool3": {
    "title": "Дэдпул 3",
    "year": 2024,
    "country": "США",
    "budget": "$150 млн",
    "genre": "Боевик, Комедия, Фантастика",
    "boxOffice": "—",
    "director": "Шон Леви",
    "poster": "DPOOL.jpg",
    "runtime": "115 мин",
    "trailer": "https://www.youtube.com/embed/-LyG8fWTOlA",
    "cast": [
      {"name": "Райан Рейнольдс", "photo": "actor_dp_ryan.jpg"},
      {"name": "Хью Джекман", "photo": "actor_dp_hugh.jpg"},
      {"name": "Морена Баккарин", "photo": "actor_dp_morena.jpg"},
      {"name": "Шон Леви", "photo": "actor_dp_sean.jpg"}
    ],
    "synopsis": "«Дэдпул 3» возвращает самого остроумного наемника Marvel. После событий последних фильмов, Дэдпул (Райан Рейнольдс) обнаруживает себя в новой вселенной и сталкивается со старыми врагами и новыми союзниками, в том числе со знаменитым Росомахой (Хью Джекман). Однако, помимо своих остроумных комментариев и способности к регенерации, ему придется проявить себя в новой битве против грядущих угроз. Новый режиссёр Шон Леви обещает ещё больше шуток и эпических битв с участием любимых персонажей.",
    "videoPlayer": "https://34085.svetacdn.in/nPBZWDQ5doe2/movie/75929?domain=kinogo.ec",
    "recommended": [
      {"title": "Similar Film 1", "photo": "recommended_dp1.jpg"},
      {"title": "Similar Film 2", "photo": "recommended_dp2.jpg"}
    ]
  },

  "taspider_man_2": {
    "title": "Человек-паук 2",
    "year": 2014,
    "country": "США",
    "budget": "$255 млн",
    "genre": "Боевик, Приключения, Фантастика",
    "boxOffice": "$700 млн",
    "director": "Марка Уэбба",
    "poster": "spiderman.jpg",
    "runtime": "142 мин",
    "trailer": "https://www.youtube.com/embed/LeasTthmHgo",
    "cast": [
      {"name": "Эндрю Гарфилд", "photo": "actor_spiderman_andy.jpg"},
      {"name": "Эмма Стоун", "photo": "actor_spiderman_emma.jpg"},
      {"name": "Джейми Фокс", "photo": "actor_spiderman_jamie.jpg"},
      {"name": "Данни Хастон", "photo": "actor_spiderman_danny.jpg"}
    ],
    "synopsis": "В \"Человек-паук 2\" Питер Паркер (Эндрю Гарфилд) сталкивается с новыми вызовами как супергерой и как обычный человек. После победы над зловещим Зеленым Гоблином, Питер пытается балансировать между своей жизнью и обязанностями Человека-паука. Его отношения с Гвен Стейси (Эмма Стоун) подвергаются испытанию, так как он решает держать ее в безопасности, отказываясь от своих чувств.\n\n                Питер сталкивается с новой угрозой — Электро (Джейми Фокс), мощным суперзлодеем, который способен управлять электричеством. В то же время он вновь встречает старого друга — Гарри Осборна (Дэйн ДеХаан), который страдает от болезни, требующей лечения. Гарри, желая получить помощь от Питера, обнаруживает тайну о Человеке-пауке, что приводит к серьезным последствиям.\n\n                Когда Электро начинает терроризировать Нью-Йорк, Питер осознает, что он должен снова надеть маску, чтобы защитить свой город и своих близких. Однако, его внутренние демоны и внешние враги ставят его на грань. Конфликт между Питером и Электро достигает своего пика, когда Питер должен сделать трудный выбор между своей личной жизнью и своим долгом как героя.\n\n                С каждой новой битвой, Питер учится, что истинная сила заключается не только в его суперспособностях, но и в любви, дружбе и самопожертвовании. Этот фильм — история о том, как Питер Паркер принимает свои обязанности и, в конечном счете, находит свое истинное призвание как Человек-паук.",
    "videoPlayer": "https://34085.svetacdn.in/nPBZWDQ5doe2/movie/76?domain=kinogo.ec",
    "recommended": [
      {"title": "Человек-паук: Вдали от дома", "photo": "recommended_spiderman1.jpg"},
      {"title": "Мстители: Финал", "photo": "recommended_spiderman2.jpg"}
    ]
  }
}



